СМП_ОнлайнОбменДанными/cfe/src/Catalogs/СМП_УчетныеЗаписиОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>СМП_УчетныеЗаписиОбменов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПравилОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередПолучениемИзмененныхОбъектов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередВыгрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередОтправкойИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередКонвертациейОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеВыгрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиПараметров</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеПолученияИнформацииОбУзлахОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПередЗагрузкойОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПриПолученииИнформацииОбУдалении</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПослеЗагрузкиДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаВыгрузкиДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИмяПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомИмяИнформационнойБазыНаСервере1СПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомИмяСервера1СПредприятия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаОбмена</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМП_НастройкиОбменов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеВыгружаемыхДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПарольПользователя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтладки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособПодключения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СМП_ВидыТранспортовОбмена</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалятьСопоставленныеОбъектыВПриемникеПриИхУдаленииВИсточнике</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФайлКаталогОбмена</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХттпСервисАдресПодключения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приемник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Конфигурации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьДанныеВРежимеОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаписыватьВИнформационнуюБазуТолькоИзмененныеОбъекты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОбъектыКВыгрузке</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПолноеИмяОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Синоним</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СКДДляОтборов</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтрокаОтбор</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОписаниеВыгружаемыхОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>АлгоритмВыборИмениПравила</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИменаПравил</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИмяПравилаПоУмолчанию</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НесколькоПравил</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОписаниеПравил</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Enums/СМП_НастройкиОбменов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СМП_НастройкиОбменов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДляОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДляПолучения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

СМП_ОнлайнОбменДанными/cfe/src/Enums/СМП_ВидыТранспортовОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СМП_ВидыТранспортовОбмена</name>
  <enumValues>
    <name>Файл</name>
  </enumValues>
  <enumValues>
    <name>ХттпСервис</name>
  </enumValues>
  <enumValues>
    <name>Ком</name>
  </enumValues>
</mdclass:Enum>

СМП_ОнлайнОбменДанными/cfe/src/Catalogs/ПравилаКонвертацииЗначений.xml
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаКонвертацииЗначений</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.ПравилаКонвертацииОбъектов</owners>
  <attributes>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Значения</types>
    </type>
  </attributes>
  <attributes>
    <name>Приемник</name>
    <type>
      <types>String</types>
      <types>CatalogRef.Значения</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеИсточник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеПриемник</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

СМП_ОнлайнОбменДанными/cfe/src/Catalogs/СМП_УчетныеЗаписиОбменов/Forms/ФормаЭлемента/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ТекДанныеОбъектыКВыгрузке;

&НаКлиенте
Перем ТекДанныеСписокПКО;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьСписокАлгоритмов();
	ЗаполнитьОбъектыКВыгрузкеНаФорме();
	КоличествоВыгружаемых = Объект.ОбъектыКВыгрузке.Количество();
	УстановитьОтборСписокПКО();
	УстановитьВидимость();
	НастроитьОформлениеИдентификаторБазы(Элементы.ИдентификаторОбмена, Объект.НастройкаОбмена);
	
	//// Обработчик подсистемы запрета редактирования реквизитов объектов
	//ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// Редактор кода
	// to do: доработать для веб-клиента
	#Если ВебКлиент Тогда
		
	#Иначе
		
		Оповещение = Новый ОписаниеОповещения("ЗагрузитьРедакторКода", ЭтотОбъект);
		НачатьПолучениеКаталогаВременныхФайлов(Оповещение);
		ОбновитьПризнакНаличияОбработчиковАлгоритмов();
		
	#КонецЕсли
	
	ОбновитьТекущийАктивныйОбработчик();
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	// Редактор кода
	Если Объект.НастройкаОбмена = ПредопределенноеЗначение("Перечисление.СМП_НастройкиОбменов.ДляПолучения") Тогда
		Объект.АлгоритмПередПолучениемИзмененныхОбъектов = Элементы.АлгоритмПередПолучениемИзмененныхОбъектовРедактор.Документ.defaultView.editor.getValue();
		Объект.АлгоритмПередКонвертациейОбъекта = Элементы.АлгоритмПередКонвертациейОбъектаРедактор.Документ.defaultView.editor.getValue();
		Объект.АлгоритмПередЗагрузкойДанных = Элементы.АлгоритмПередЗагрузкойДанныхРедактор.Документ.defaultView.editor.getValue();
		Объект.АлгоритмПослеЗагрузкиПараметров = Элементы.АлгоритмПослеЗагрузкиПараметровРедактор.Документ.defaultView.editor.getValue();
		Объект.АлгоритмПередЗагрузкойОбъекта = Элементы.АлгоритмПередЗагрузкойОбъектаРедактор.Документ.defaultView.editor.getValue();
		Объект.АлгоритмПриПолученииИнформацииОбУдалении = Элементы.АлгоритмПриПолученииИнформацииОбУдаленииРедактор.Документ.defaultView.editor.getValue();
		Объект.АлгоритмПослеЗагрузкиОбъекта = Элементы.АлгоритмПослеЗагрузкиОбъектаРедактор.Документ.defaultView.editor.getValue();
		Объект.АлгоритмПослеЗагрузкиДанных = Элементы.АлгоритмПослеЗагрузкиДанныхРедактор.Документ.defaultView.editor.getValue();
	КонецЕсли
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ОбновитьОбъектыКВыгрузке(ТекущийОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	УстановитьОтборСписокПКО();
	
	//// Обработчик подсистемы запрета редактирования реквизитов объектов
	//ЗапретРедактированияРеквизитовОбъектов.ЗаблокироватьРеквизиты(ЭтотОбъект);
	//// Конец СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НастройкаОбменаПриИзменении(Элемент)
	
	УстановитьВидимость();
	НастроитьОформлениеИдентификаторБазы(Элементы.ИдентификаторОбмена, Объект.НастройкаОбмена);
	
КонецПроцедуры

&НаКлиенте
Процедура СпособПодключенияПриИзменении(Элемент)
	
	УстановитьВидимость();
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура ФайлКаталогОбменаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = "Выберите каталог для обмена данными";
	ДиалогВыбора.Каталог = ?(ПустаяСтрока(Объект.ФайлКаталогОбмена), КаталогДокументов(), Объект.ФайлКаталогОбмена);
	Обещание = Ждать ДиалогВыбора.ВыбратьАсинх();
	
	Если Обещание <> Неопределено Тогда
		Объект.ФайлКаталогОбмена = Обещание[0];
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИсточникПриИзменении(Элемент)
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура ТолькоВыбранныеПриИзменении(Элемент)
	
	Если ТолькоВыбранные Тогда
		Элементы.ОбъектыКВыгрузкеНаФорме.ОтборСтрок = Новый ФиксированнаяСтруктура(Новый Структура("Пометка", Истина));
	Иначе
		Элементы.ОбъектыКВыгрузкеНаФорме.ОтборСтрок = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбщегоНазначенияКлиент.ПоказатьФормуРедактированияКомментария(Элемент.ТекстРедактирования, ЭтотОбъект, "Объект.Комментарий");
КонецПроцедуры

&НаКлиенте
Процедура СтраницыАлгоритмыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	ОбновитьТекущийАктивныйОбработчик();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ОбъектыКВыгрузкеНаФорме

&НаКлиенте
Процедура ОбъектыКВыгрузкеНаФормеВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекДанные = Элементы.ОбъектыКВыгрузкеНаФорме.ТекущиеДанные;
	
	Если ТекДанные <> Неопределено И Поле.Имя = "ОбъектыКВыгрузкеНаФормеСиноним" Тогда
		ОткрытьФорму(ТекДанные.ИмяОбъекта + ".ФормаСписка");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыКВыгрузкеНаФормеПриАктивизацииСтроки(Элемент)
	
	ТекДанныеОбъектыКВыгрузке = Элементы.ОбъектыКВыгрузкеНаФорме.ТекущиеДанные;
	
	АдресСхемы = Неопределено;
	Если ТекДанныеОбъектыКВыгрузке.Пометка И КоллекцияСКД.Свойство(ТекДанныеОбъектыКВыгрузке.Имяобъекта, АдресСхемы) Тогда
		ИнициализироватьКомпоновщик(АдресСхемы);
	Иначе
		КомпоновщикОтборов.Настройки.Отбор.Элементы.Очистить();
	КонецЕсли;
	
	УстановитьДоступностьКомпоновщикаНастроек();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектыКВыгрузкеНаФормеПометкаПриИзменении(Элемент)
	
	Если ТекДанныеОбъектыКВыгрузке.Пометка Тогда
		
		// Инициализация новой схемы СКД и компоновщика настроек
		СоздатьСКДНаКлиенте();
		АдресСхемы = Неопределено;
		КоллекцияСКД.Свойство(ТекДанныеОбъектыКВыгрузке.ИмяОбъекта, АдресСхемы);
		Если ЭтоАдресВременногоХранилища(АдресСхемы) Тогда
			ИнициализироватьКомпоновщик(АдресСхемы);
		КонецЕсли;
		
		КоличествоВыгружаемых = КоличествоВыгружаемых + 1;
		
	Иначе
		
		КомпоновщикОтборов.Настройки.Отбор.Элементы.Очистить();
		КоллекцияСКД.Удалить(ТекДанныеОбъектыКВыгрузке.ИмяОбъекта);
		
		КоличествоВыгружаемых = КоличествоВыгружаемых - 1;
		
	КонецЕсли;

	УстановитьДоступностьКомпоновщикаНастроек();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_КомпоновщикОтборовНастройкиОтбор

&НаКлиенте
Процедура КомпоновщикОтборовНастройкиОтборПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	ОбновитьОтборыСКД(ТекДанныеОбъектыКВыгрузке.ИмяОбъекта);
	
КонецПроцедуры

&НаКлиенте
Процедура КомпоновщикОтборовНастройкиОтборПослеУдаления(Элемент)
	
	ОбновитьОтборыСКД(ТекДанныеОбъектыКВыгрузке.ИмяОбъекта);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокПКО

&НаКлиенте
Процедура СписокПКОПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокПКО.ТекущиеДанные <> Неопределено Тогда
		ТекДанныеСписокПКО = Элементы.СписокПКО.ТекущиеДанные;
		ТекущееПКО = Элементы.СписокПКО.ТекущиеДанные.Ссылка;
	КонецЕсли;
	
	УстановитьОтборыЗависимыхПравил();
	ОпределитьНаличиеПКСПКЗ();
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПКОПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если НЕ ЗначениеЗаполнено(Объект.Источник) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана конфигурация-источник!",,"Источник", "Объект", Отказ);
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Приемник) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю("Не указана конфигурация-приемник!",,"Приемник", "Объект", Отказ);
		Возврат;
	КонецЕсли;
	
	Если Объект.Ссылка.Пустая() Тогда
		
		Отказ = Истина;
		ТекстВопроса = "Перед началом добавления правил конвертации объектов учетную запись обмена данными нужно записать. Продолжить?";
		РежимВопроса = РежимДиалогаВопрос.ДаНет;
		ОписаниеОповещения = Новый ОписаниеОповещения("СписокПКОПередНачаломДобавленияЗавершение", 
		ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения, ТекстВопроса, РежимВопроса);
		
	ИначеЕсли НЕ Группа Тогда
		
		Отказ = Истина;
		мПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Владелец, КонфигурацияИсточник, КонфигурацияПриемник", Объект.Ссылка, Объект.Источник, Объект.Приемник));
		ОткрытьФорму("Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента", 
		мПараметрыФормы, 
		Элементы.СписокПКО,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

// Обработчик оповещения вопроса.
//
&НаКлиенте
Процедура СписокПКОПередНачаломДобавленияЗавершение(РезультатВпроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВпроса = КодВозвратаДиалога.Да Тогда
		Если ЭтотОбъект.Записать() Тогда
			мПараметрыФормы = Новый Структура("ЗначенияЗаполнения", Новый Структура("Владелец, КонфигурацияИсточник", Объект.Ссылка, Объект.Источник));
			ОткрытьФорму("Справочник.ПравилаКонвертацииОбъектов.Форма.ФормаЭлемента", 
			мПараметрыФормы, 
			Элементы.СписокПКО,,,,, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //СписокПКОПередНачаломДобавленияЗавершение

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокПКС

&НаКлиенте
Процедура СписокПКСПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ТекущееПКО.Пустая() Тогда
		Отказ = Истина;
		ПредупреждениеАсинх("Отсутствуют правила конвертации объектов!");
	ИначеЕсли ТекДанныеСписокПКО.ЭтоГруппа Тогда
		Отказ = Истина;
		ПредупреждениеАсинх("Группа не может быть владельцем правил!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_СписокПКЗ

&НаКлиенте
Процедура СписокПКЗПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Если ТекущееПКО.Пустая() Тогда
		Отказ = Истина;
		ПредупреждениеАсинх("Отсутствуют правила конвертации объектов!");
	ИначеЕсли ТекДанныеСписокПКО.ЭтоГруппа Тогда
		Отказ = Истина;
		ПредупреждениеАсинх("Группа не может быть владельцем правил!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура ПроверитьПодключение(Команда)
	
	Если Объект.Ссылка.Пустая() Тогда
		
		ТекстВопроса = "Нужно сохранить учетную запись перед проверкой подключения. Продолжить?";
		РежимВопроса = РежимДиалогаВопрос.ДаНет;
		Результат = Ждать ВопросАсинх(ТекстВопроса, РежимВопроса);
		Если Результат = КодВозвратаДиалога.Да Тогда
			ЭтотОбъект.Записать();
			ВыполнитьПроверкуПодключения();
		КонецЕсли;
	Иначе
		ВыполнитьПроверкуПодключения();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьОписаниеКонфигурации(Команда)
	
	Если Объект.НастройкаОбмена = ПредопределенноеЗначение("Перечисление.СМП_НастройкиОбменов.ДляОтправки") Тогда
		СтруктураПараметров = Новый Структура("парКонфигурация", Объект.Приемник);
	ИначеЕсли Объект.НастройкаОбмена = ПредопределенноеЗначение("Перечисление.СМП_НастройкиОбменов.ДляПолучения") Тогда
		СтруктураПараметров = Новый Структура("парКонфигурация", Объект.Источник);
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ЗагрузкаСтруктурыКонфигурации.Форма", СтруктураПараметров);
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьОписаниеКонфигурации(Команда)
	Сообщить("Этот функционал в процессе разработки");
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьРедакторКода(Команда)
	
	ТекстОбработчика = Элементы[ТекущийАктивныйОбработчик + "Редактор"].Документ.defaultView.editor.getValue();
	мПараметры = Новый Структура("ТекстОбработчика", ТекстОбработчика);
	Оповещение = Новый ОписаниеОповещения("ПослеЗакрытияРедактораКода", ЭтотОбъект);
	ОткрытьФорму("Обработка.СМП_РедакторКода.Форма", мПараметры, ЭтотОбъект,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

// Обработчик оповещения.
//
&НаКлиенте
Процедура ПослеЗакрытияРедактораКода(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Элементы[ТекущийАктивныйОбработчик + "Редактор"].Документ.defaultView.editor.setValue(РезультатЗакрытия);
	 
	Если РезультатЗакрытия <> Объект[ТекущийАктивныйОбработчик] Тогда
		Объект[ТекущийАктивныйОбработчик] = РезультатЗакрытия;
		Модифицированность = Истина;
		ОбновитьПризнакНаличияОбработчиковАлгоритмов();
	КонецЕсли;
	
КонецПроцедуры //ПослеЗакрытияРедактораКода

&НаКлиенте
Процедура ПКСВверх(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	Иначе
		ИзменитьПорядокПКС(Команда.ИспользуемаяТаблица.ТекущиеДанные.Ссылка, -1);
		Команда.ИспользуемаяТаблица.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПКСВниз(Команда)
	
	Если Команда.ИспользуемаяТаблица.ТекущиеДанные = Неопределено Тогда
		Возврат;
	Иначе
		ИзменитьПорядокПКС(Команда.ИспользуемаяТаблица.ТекущиеДанные.Ссылка, 1);
		Команда.ИспользуемаяТаблица.Обновить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет список реквизитов с алгоритмами:
//
// Параметры:
//   Нет.
//
&НаСервере
Процедура ЗаполнитьСписокАлгоритмов() 
	
	ЭтотОбъект.СписокАлгоритмов = Новый Структура;
	СписокАлгоритмов.Вставить("АлгоритмПослеЗагрузкиПравилОбменаРедактор", 				Объект.АлгоритмПослеЗагрузкиПравилОбмена);
	СписокАлгоритмов.Вставить("АлгоритмПередВыгрузкойДанныхРедактор", 					Объект.АлгоритмПередВыгрузкойДанных);
	СписокАлгоритмов.Вставить("АлгоритмПередПолучениемИзмененныхОбъектовРедактор", 		Объект.АлгоритмПередПолучениемИзмененныхОбъектов);
	СписокАлгоритмов.Вставить("АлгоритмПередВыгрузкойОбъектаРедактор", 					Объект.АлгоритмПередВыгрузкойОбъекта);
	СписокАлгоритмов.Вставить("АлгоритмПередОтправкойИнформацииОбУдаленииРедактор", 	Объект.АлгоритмПередОтправкойИнформацииОбУдалении);
	СписокАлгоритмов.Вставить("АлгоритмПередКонвертациейОбъектаРедактор", 				Объект.АлгоритмПередКонвертациейОбъекта);
	СписокАлгоритмов.Вставить("АлгоритмПослеВыгрузкиОбъектаРедактор", 					Объект.АлгоритмПослеВыгрузкиОбъекта);
	СписокАлгоритмов.Вставить("АлгоритмПослеВыгрузкиДанныхРедактор", 					Объект.АлгоритмПослеВыгрузкиДанных);
	СписокАлгоритмов.Вставить("АлгоритмПередЗагрузкойДанныхРедактор", 					Объект.АлгоритмПередЗагрузкойДанных);
	СписокАлгоритмов.Вставить("АлгоритмПослеЗагрузкиПараметровРедактор", 				Объект.АлгоритмПослеЗагрузкиПараметров);
	СписокАлгоритмов.Вставить("АлгоритмПослеПолученияИнформацииОбУзлахОбменаРедактор", 	Объект.АлгоритмПослеПолученияИнформацииОбУзлахОбмена);
	СписокАлгоритмов.Вставить("АлгоритмПередЗагрузкойОбъектаРедактор", 					Объект.АлгоритмПередЗагрузкойОбъекта);
	СписокАлгоритмов.Вставить("АлгоритмПриПолученииИнформацииОбУдаленииРедактор", 		Объект.АлгоритмПриПолученииИнформацииОбУдалении);
	СписокАлгоритмов.Вставить("АлгоритмПослеЗагрузкиОбъектаРедактор", 					Объект.АлгоритмПослеЗагрузкиОбъекта);
	СписокАлгоритмов.Вставить("АлгоритмПослеЗагрузкиДанныхРедактор", 					Объект.АлгоритмПослеЗагрузкиДанных);
	
КонецПроцедуры //ЗаполнитьСписокАлгоритмов

// Изменение порядка ПКС.
//
// Параметры:
//   СсылкаПКС - СправочникСсылка.ПравилаКонвертацииСвойств - текущее правило, для которого изменяется порядок
//   Направление - Число - признак увеличения или уменьшения
//
&НаСервереБезКонтекста
Процедура ИзменитьПорядокПКС(СсылкаПКС, Направление) 
	
	Справочники.ПравилаКонвертацииСвойств.ИзменитьПорядок(СсылкаПКС, Направление);
	
КонецПроцедуры //ИзменитьПорядокПКС

// Визуальное выделение вкладок с ПКС и ПКЗ.
//
// Параметры:
//   
//
&НаКлиенте
Процедура ОпределитьНаличиеПКСПКЗ() 
	
	сНаличиеПравил = НаличиеПКСПКЗ(ТекущееПКО);
	ЗаголовокПКС = ?(сНаличиеПравил.ПКС >0, СтрШаблон("Конвертация свойств (%1)", сНаличиеПравил.ПКС), "Конвертация свойств");
	ЗаголовокПКЗ = ?(сНаличиеПравил.ПКЗ > 0, СтрШаблон("Конвертация значений (%1)", сНаличиеПравил.ПКЗ), "Конвертация значений");
	
	Если сНаличиеПравил.ПКЗ > 0 И сНаличиеПравил.ПКС > 0
		ИЛИ (сНаличиеПравил.ПКС = 0 И сНаличиеПравил.ПКЗ = 0) Тогда
		Возврат;
	КонецЕсли;
	
	Если сНаличиеПравил.ПКЗ > 0 Тогда
		Элементы.СтраницыКонвертаций.ТекущаяСтраница = Элементы.СтраницаПКЗ;
	КонецЕсли;
	
	Если сНаличиеПравил.ПКС > 0 Тогда
		Элементы.СтраницыКонвертаций.ТекущаяСтраница = Элементы.СтраницаПКС;
	КонецЕсли;
	
КонецПроцедуры //ОпределитьНаличиеПКСПКЗ

// .
//
// Параметры:
//  ПКОСсылка - СправочникСсылка.ПравилаКонвертацииОбъектов - текущее ПКО
//
// Возвращаемое значение:
//   Структура - результат наличия ПКС и ПКЗ
//
&НаСервереБезКонтекста
Функция НаличиеПКСПКЗ(ПКОСсылка) 
	
	сРезультат = Новый Структура("ПКС, ПКЗ", 0, 0);
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПравилаКонвертацииСвойств.Ссылка) КАК КоличествоПКС
	|ИЗ
	|	Справочник.ПравилаКонвертацииСвойств КАК ПравилаКонвертацииСвойств
	|ГДЕ
	|	ПравилаКонвертацииСвойств.Владелец = &Владелец
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПравилаКонвертацииЗначений.Ссылка) КАК КоличествоПКЗ
	|ИЗ
	|	Справочник.ПравилаКонвертацииЗначений КАК ПравилаКонвертацииЗначений
	|ГДЕ
	|	ПравилаКонвертацииЗначений.Владелец = &Владелец";
	Запрос.УстановитьПараметр("Владелец", ПКОСсылка);
	мРезультатЗапроса = Запрос.ВыполнитьПакет();
	Выборка = мРезультатЗапроса[0].Выбрать();
	Выборка.Следующий();
	сРезультат.ПКС = Выборка.КоличествоПКС;
	Выборка = мРезультатЗапроса[1].Выбрать();
	Выборка.Следующий();
	сРезультат.ПКЗ = Выборка.КоличествоПКЗ;
	
	Возврат сРезультат;
	
КонецФункции // НаличиеПКСПКЗ

// СтандартныеПодсистемы.ЗапретРедактированияРеквизитовОбъектов
&НаКлиенте
Процедура Подключаемый_РазрешитьРедактированиеРеквизитовОбъекта(Команда)
	ЗапретРедактированияРеквизитовОбъектовКлиент.РазрешитьРедактированиеРеквизитовОбъекта(ЭтотОбъект);
КонецПроцедуры

// Выполняет установку видимости элементов формы.
//
&НаСервере
Процедура УстановитьВидимость()
	
	ЭтоОтправка   = (Объект.НастройкаОбмена = ПредопределенноеЗначение("Перечисление.СМП_НастройкиОбменов.ДляОтправки"));
	ЭтоПолучение  = (Объект.НастройкаОбмена = ПредопределенноеЗначение("Перечисление.СМП_НастройкиОбменов.ДляПолучения"));
	ЭтоФайл 	  = (Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.СМП_ВидыТранспортовОбмена.Файл"));
	ЭтоХттпСервис = (Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.СМП_ВидыТранспортовОбмена.ХттпСервис"));
	ЭтоКом 		  = (Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.СМП_ВидыТранспортовОбмена.Ком"));
	
	// Отправка
	Элементы.ДатаНачалаВыгрузкиДокументов.Видимость = ЭтоОтправка;
	Элементы.ГруппаНастройкиДляОтправки.Видимость = ЭтоОтправка;
	Элементы.ПроверитьПодключение.Видимость = ЭтоОтправка;
	Элементы.СтраницаОбъектыКВыгрузке.Видимость = ЭтоОтправка;
	
	Элементы.ФайлКаталогОбмена.Видимость = ЭтоФайл;
	Элементы.ХттпСервисАдресПодключения.Видимость = ЭтоХттпСервис;
	Элементы.КомИмяСервера1СПредприятия.Видимость = ЭтоКом;
	Элементы.КомИмяИнформационнойБазыНаСервере1СПредприятия.Видимость = ЭтоКом;
	Элементы.ИмяПользователя.Видимость = ЭтоХттпСервис Или ЭтоКом;
	Элементы.ПарольПользователя.Видимость = ЭтоХттпСервис Или ЭтоКом;
	
	// Получение
	//Элементы.ГруппаНастройкиДляПолучения.Видимость = ЭтоПолучение;
	//Элементы.Источник.Видимость = ЭтоПолучение;
	//Элементы.Приемник.Видимость = ЭтоОтправка;
	//Элементы.СтраницаНастройкиЗагрузки.Видимость = ЭтоПолучение;
	//Элементы.СтраницаОбработчикиСобытий.Видимость = ЭтоПолучение;
	
КонецПроцедуры //УстановитьВидимость

// Устанавливает доступность таблицы компоновщика настроек КД на форме.
//
&НаКлиенте
Процедура УстановитьДоступностьКомпоновщикаНастроек()
	
	Элементы.КомпоновщикОтборовНастройкиОтбор.ТолькоПросмотр = НЕ ТекДанныеОбъектыКВыгрузке.Пометка;
	
КонецПроцедуры //УстановитьДоступностьКомпоновщикаНастроек

// Заполняет таблицу объектов к выгрузке на форме при создании на сервере.
//
&НаСервере
Процедура ЗаполнитьОбъектыКВыгрузкеНаФорме() 
	
	Картинка = БиблиотекаКартинок.ДокументОбъект;
	тзДок = ОбъектыКВыгрузкеНаФорме.Выгрузить();
	тзДок.Очистить();
	мдДокументы = Метаданные.Документы;
	
	Для Каждого мдДок Из мдДокументы Цикл
		НоваяСтрока = тзДок.Добавить();
		НоваяСтрока.Картинка = Картинка;
		НоваяСтрока.ПолноеИмяОбъекта = мдДок.ПолноеИмя();
		НоваяСтрока.Синоним = мдДок.Представление();
		НоваяСтрока.ИмяОбъекта = СтрЗаменить(НоваяСтрока.ПолноеИмяОбъекта, ".", "");
	КонецЦикла;
	
	Если Объект.ОбъектыКВыгрузке.Количество() > 0 Тогда
		
		СпрОбъект = РеквизитФормыВЗначение("Объект", Тип("СправочникОбъект.СМП_УчетныеЗаписиОбменов"));
		СпрОбъект.ПолучитьСКДИзТабЧасти(тзДок, КоллекцияСКД, ЭтотОбъект.УникальныйИдентификатор);
		
	КонецЕсли;
	
	тзДок.Сортировать("Синоним");
	ОбъектыКВыгрузкеНаФорме.Загрузить(тзДок);
	
КонецПроцедуры //ЗаполнитьОбъектыКВыгрузкеНаФорме

// Заполняет таблицу объектов к выгрузке перед записью элемента спр..
//
// Параметры:
//   ТекущийОбъект - СправочникОбъект.СМП_УчетныеЗаписиОбменов - элемент в котором обновляется список объектов к выгрузке.
//
&НаСервере
Процедура ОбновитьОбъектыКВыгрузке(ТекущийОбъект) 
	
	тзОбъекты = ОбъектыКВыгрузкеНаФорме.Выгрузить(Новый Структура("Пометка", Истина));
	Если тзОбъекты.Количество() > 0 Тогда
		ТекущийОбъект.ОбъектыКВыгрузке.Загрузить(тзОбъекты);
		ТекущийОбъект.ПоместитьСКДВТабЧасть(КоллекцияСКД);
	Иначе
		ТекущийОбъект.ОбъектыКВыгрузке.Очистить();
	КонецЕсли;
	
КонецПроцедуры //ОбновитьОбъектыКВыгрузке

// Выполняет установку отбора для ПКО.
//
&НаСервере
Процедура УстановитьОтборСписокПКО() 
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	СписокПКО, 
	"Владелец", 
	Объект.Ссылка, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	Истина, 
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры //УстановитьОтборПКО

// Выполняет установку отборов ПКС, ПКЗ.
//
&НаКлиенте
Процедура УстановитьОтборыЗависимыхПравил() 
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	СписокПКС, 
	"Владелец", 
	ТекущееПКО, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	Истина, 
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	СписокПКЗ, 
	"Владелец", 
	ТекущееПКО, 
	ВидСравненияКомпоновкиДанных.Равно,
	, 
	Истина, 
	РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный);
	
КонецПроцедуры //УстановитьОтборыЗависимыхПравил

// Выполняет настройку оформления реквизита "ИдентификаторБазы".
//
// Параметры:
//   элИдентификаторБазы - ПолеФормы - оформляемое поле.
//   НастройкаОбмена - ПеречислениеСсылка.СМП_НастройкиОбменов - значение настройки обмена (выгрузка/загрузка).
//
&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьОформлениеИдентификаторБазы(элИдентификаторБазы, НастройкаОбмена) 
	
	Если НастройкаОбмена = ПредопределенноеЗначение("Перечисление.СМП_НастройкиОбменов.ДляОтправки") Тогда
		элИдентификаторБазы.Заголовок = "ID обмена-получателя";
	ИначеЕсли НастройкаОбмена = ПредопределенноеЗначение("Перечисление.СМП_НастройкиОбменов.ДляПолучения") Тогда
		элИдентификаторБазы.Заголовок = "ID текущего обмена";
	КонецЕсли;
	
КонецПроцедуры //НастроитьОформлениеИдентификаторБазы

// Выполняет проверку подключения.
//
// Параметры:
// нет.
//
&НаКлиенте
Процедура ВыполнитьПроверкуПодключения() 
	
	Если Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.СМП_ВидыТранспортовОбмена.Файл") Тогда
		
		Если ПустаяСтрока(Объект.ФайлКаталогОбмена) Тогда
			
			ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите путь к каталогу обмена!",, "ФайлКаталогОбмена", "Объект");
			Возврат;
			
		Иначе
			
			Попытка
				АдресКаталога = Объект.ФайлКаталогОбмена + "\" + Строка(Новый УникальныйИдентификатор);
				СоздатьКаталог(АдресКаталога);
				УдалитьФайлы(АдресКаталога);
				ОбщегоНазначенияКлиент.СообщитьПользователю("Каталог доступен для записи",, "ФайлКаталогОбмена", "Объект");
			Исключение
				Сообщить(ОписаниеОшибки());
			КонецПопытки;
		КонецЕсли;
		
	ИначеЕсли Объект.СпособПодключения = ПредопределенноеЗначение("Перечисление.СМП_ВидыТранспортовОбмена.ХттпСервис") Тогда
		
		Если ПустаяСтрока(Объект.ХттпСервисАдресПодключения) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите адрес подключения к базе-приемнику",, "ХттпСервисАдресПодключения", "Объект");
			Возврат;
		ИначеЕсли ПустаяСтрока(Объект.ИмяПользователя) Тогда
			ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите имя пользователя",, "ИмяПользователя", "Объект");
			Возврат;
		//ИначеЕсли ПустаяСтрока(Объект.ПарольПользователя) Тогда
		//	ОбщегоНазначенияКлиент.СообщитьПользователю("Укажите пароль пользователя",, "ПарольПользователя", "Объект");
		//	Возврат;
		Иначе
			ПараметрыФункции = Новый Структура("АдресПодключения, ИдентификаторОбмена, ИмяПользователя, ПарольПользователя", 
				Объект.ХттпСервисАдресПодключения, 
				Объект.ИдентификаторОбмена,
				Объект.ИмяПользователя,
				Объект.ПарольПользователя);
			ДлительнаяОперация = ЗапуститьПроверкуПодключенияВФоне(ЭтотОбъект.УникальныйИдентификатор, ПараметрыФункции);
			
			ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
			ПараметрыОжидания.ВыводитьОкноОжидания = Истина;
			ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
			ПараметрыОжидания.ВыводитьСообщения = Истина;
			ПараметрыОжидания.ОповещениеПользователя.Показать = Истина;
			ПараметрыОжидания.ТекстСообщения = "Проверка подключения к базе-приемнику...";
			ПараметрыОжидания.ОповещениеПользователя.Текст = "Выполнена проверка подключения";
			ПараметрыОжидания.ОповещениеПользователя.Пояснение = нСтр("ru='Завершено.'; uk='Завершено.'");
			
			ОповещениеОЗавершении = Новый ОписаниеОповещения("ВыполнитьПроверкуПодключенияЗавершение", ЭтотОбъект);
			ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры //ВыполнитьПроверкуПодключения

// Обработчик оповещения.
//
// Параметры:
//   Результат - Структура - результат выполнения фонового задания.
//   ДополнительныеПараметры - Произвольный - параметры указанные при создании оповещения.
//
&НаКлиенте
Процедура ВыполнитьПроверкуПодключенияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда 
		ОбщегоНазначенияКлиент.СообщитьПользователю(нСтр("ru='Фоновое задание отменено.'; uk='Фонове завдання відмінене.'"));
	Иначе
		Если Результат.Статус = "Ошибка" Тогда 
			ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.КраткоеПредставлениеОшибки + Символы.ПС + Результат.ПодробноеПредставлениеОшибки); 
		ИначеЕсли Результат.Статус = "Выполнено" Тогда 
			Для Каждого Сообщение Из Результат.Сообщения Цикл
				Сообщение.Сообщить();
			КонецЦикла;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры //ВыполнитьПроверкуПодключенияЗавершение

// Возвращает информацию по выполненю фонового задания.
//
// Параметры:
//   ИдентификаторФормы - УникальныйИдентификатор - УИД формы для возврата результата выполнения фонового задания
//   ПараметрыФункции - Структура:
//						* АдресПодключения - Строка - Адрес публикации базы-приемника
//						* ИдентификаторОбмена - Строка - идентификатор учетной записи обмена данными в базе-приемнике
//
// Возвращаемое значение:
//   Структура - см. ДлительныеОперации.ВыполнитьФункцию().
//
&НаСервереБезКонтекста
Функция ЗапуститьПроверкуПодключенияВФоне(ИдентификаторФормы, ПараметрыФункции) 
	
	мПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(ИдентификаторФормы);
	мПараметрыВыполнения.НаименованиеФоновогоЗадания = "Онлайн обмен данными: проверка подключения по адресу " + ПараметрыФункции.АдресПодключения;
	мПараметрыВыполнения.ЗапуститьВФоне = Истина;
	мПараметрыВыполнения.КлючФоновогоЗадания = ИдентификаторФормы;
	
	Результат = ДлительныеОперации.ВыполнитьФункцию(мПараметрыВыполнения, 
	"СМП_СобытияОтправкиДанных.ПолучитьРезультатПроверкиПодключенияПоХТТП", ПараметрыФункции);
	
	Возврат Результат;
	
КонецФункции // ЗапуститьПроверкуПодключенияВФоне

#Область РАБОТА_С_ОТБОРАМИ_СКД

// Запускает создание СКД для документа.
//
// Параметры:
//   ИмяДокумента - Строка - имя документа, как оно задано в конфигураторе.
//
&НаКлиенте
Асинх Процедура СоздатьСКДНаКлиенте() 
	
	Если ТекДанныеОбъектыКВыгрузке <> Неопределено Тогда
		РезультатСоздания = Ждать СоздатьСКД();
		Сообщить(РезультатСоздания);
	КонецЕсли;
	
КонецПроцедуры //СоздатьСКДНаКлиенте

// Возвращает имя документа для которого создана СКД.
//
// Параметры:
//   ИмяДокумента - Строка - имя документа, как оно задано в конфигураторе.
//
// Возвращаемое значение:
//   Строка - Имя документа для которого создана СКД
//
&НаКлиенте
Асинх Функция СоздатьСКД() 
	
	СоздатьСКДДляВыгрузкиДокумента(ТекДанныеОбъектыКВыгрузке.ПолноеИмяОбъекта, ТекДанныеОбъектыКВыгрузке.ИмяОбъекта);
	ТекстСообщения = СтрШаблон("Созданы настройки для документа ""%1""", ТекДанныеОбъектыКВыгрузке.Синоним);
	Возврат ТекстСообщения;
	
КонецФункции // СоздатьСКДАсинх

// Создает СКД для отбора документов при выгрузке.
//
// Параметры:
//   ИмяДокумента - Строка - имя документа, как оно задано в конфигураторе.
//
&НаСервере
Процедура СоздатьСКДДляВыгрузкиДокумента(ПолноеИмяОбъекта, ИмяСКД) 
	
	СКД = Справочники.СМП_УчетныеЗаписиОбменов.ПолучитьСКД(ПолноеИмяОбъекта);
	//ИнициализироватьКомпоновщик(СКД);
	АдресСхемы = ПоместитьВоВременноеХранилище(СКД, ЭтотОбъект.УникальныйИдентификатор);
	КоллекцияСКД.Вставить(ИмяСКД, АдресСхемы);
	
КонецПроцедуры //СоздатьСКДДляВыгрузкиДокумента

// Выполняет инициализацию компоновщика настроек компоновки данных для выбранного или выделенного документа.
//
// Параметры:
//   ИсточникНастроек - СхемаКомпоновкиДанных, АдресВременногоХранилища - источник настроек для компоновщика.
//
&НаСервере
Процедура ИнициализироватьКомпоновщик(ИсточникНастроек)
	
	Если ТипЗнч(ИсточникНастроек) = Тип("СхемаКомпоновкиДанных") Тогда
		НастройкиКомпоновкиДанных = ИсточникНастроек.НастройкиПоУмолчанию;
	ИначеЕсли ЭтоАдресВременногоХранилища(ИсточникНастроек) Тогда
		НастройкиКомпоновкиДанных = ПолучитьИзВременногоХранилища(ИсточникНастроек).НастройкиПоУмолчанию;
	КонецЕсли;
	
	КомпоновщикОтборов.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(ИсточникНастроек));
	КомпоновщикОтборов.ЗагрузитьНастройки(НастройкиКомпоновкиДанных);
	КомпоновщикОтборов.Восстановить(СпособВосстановленияНастроекКомпоновкиДанных.ПроверятьДоступность);
	
КонецПроцедуры //ИнициализироватьКомпоновщик

// Обновляет список отборов в СКД для выбранного документа.
//
// Параметры:
//   ИмяДокумента - Строка - имя документа вида "ДокументАвансовыйОтчет", используется как ключ в структуре "КоллекцияСКД".
//
&НаКлиенте
Процедура ОбновитьОтборыСКД(ИмяДокумента) 
	
	АдресСхемыКД = Неопределено;
	Если КоллекцияСКД.Свойство(ИмяДокумента, АдресСхемыКД) Тогда
		
		Если ЭтоАдресВременногоХранилища(АдресСхемыКД) Тогда
			ПерезаполнитьОтборыСКДНаСервере(ИмяДокумента, АдресСхемыКД);
		Иначе
			Сообщить("Неверный адрес временного хранилища схемы КД");
		КонецЕсли;
	Иначе
		
		Сообщить("В коллекции отсутствует СКД для документа " + ИмяДокумента);
		
	КонецЕсли;
	
КонецПроцедуры //ОбновитьОтборыСКД

// Перезаполняет отборы СКД для конкретного документа.
//
// Параметры:
//   ИмяДокумента - Строка - имя документа вида "ДокументАвансовыйОтчет", используется как ключ в структуре "КоллекцияСКД".
//   АдресСхемыКД - Строка - адрес временного хранилища СКД.
//
&НаСервере
Процедура ПерезаполнитьОтборыСКДНаСервере(ИмяДокумента, АдресСхемыКД) 
	
	СКД = ПолучитьИзВременногоХранилища(АдресСхемыКД);
	Если СКД = Неопределено Тогда
		Сообщить("Не удалось обновить значения отборов: для документа " + ИмяДокумента + " отсутствует СКД во временном хранилище");
		Возврат;
	КонецЕсли;
	
	ОтборыКД = СКД.НастройкиПоУмолчанию.Отбор.Элементы;
	ОтборыКД.Очистить();
	
	ОтборыКомпоновщик = КомпоновщикОтборов.Настройки.Отбор.Элементы;
	
	Если ОтборыКомпоновщик.Количество() > 0 Тогда
		ЗаполнитьКоллекциюОтборов(ОтборыКД, ОтборыКомпоновщик);
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(СКД, АдресСхемыКД);
	
КонецПроцедуры //ПерезаполнитьОтборыСКДНаСервере

// Заполняет коллекцию отборов КД.
//
// Параметры:
//   КоллекцияПриемник - КоллекцияЭлементовОтбораКомпоновкиДанных - 
//   КоллекцияИсточник - КоллекцияЭлементовОтбораКомпоновкиДанных -  
//
&НаСервере
Процедура ЗаполнитьКоллекциюОтборов(КоллекцияПриемник, КоллекцияИсточник) 
	
	ТипЭлемент = Тип("ЭлементОтбораКомпоновкиДанных");
	ТипГруппа = Тип("ГруппаЭлементовОтбораКомпоновкиДанных");
	
	Для Каждого ЭлементИсточник Из КоллекцияИсточник Цикл
		
		Если ТипЗнч(ЭлементИсточник) = ТипГруппа Тогда
			ЭлементПриемник = КоллекцияПриемник.Добавить(ТипГруппа);
			ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
			ЗаполнитьКоллекциюОтборов(ЭлементПриемник.Элементы, ЭлементИсточник.Элементы);
		Иначе
			ЭлементПриемник = КоллекцияПриемник.Добавить(ТипЭлемент);
			ЗаполнитьЗначенияСвойств(ЭлементПриемник, ЭлементИсточник);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры //ЗаполнитьКоллекциюОтборов

#КонецОбласти

#Область РЕДАКТОР_КОДА

&НаКлиенте
Процедура ЗагрузитьРедакторКода(ИмяКаталогаВременныхФайлов, ДополнительныеПараметры) Экспорт
	
	СМП_РедакторКодаКлиент.ЗагрузитьРедактор(ЭтотОбъект, СписокАлгоритмов, ИмяКаталогаВременныхФайлов);
	
	Для Каждого кзДанныеПоля ИЗ СписокАлгоритмов Цикл
		ЭтотОбъект.ОбновитьОтображениеДанных(Элементы[кзДанныеПоля.Ключ]);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПризнакНаличияОбработчиковАлгоритмов()

	Картинка = БиблиотекаКартинок.СинтаксическийКонтроль;
	ПустаяКартинка = Новый Картинка;
	ЕстьОбработчики = Ложь;
	
	Для Каждого КЗ Из СписокАлгоритмов Цикл
		ИмяРеквизита = СтрЗаменить(КЗ.Ключ, "Редактор", "");
		ИмяЭлемента = "Страница" + ИмяРеквизита;
		Если ЗначениеЗаполнено(Объект[ИмяРеквизита]) Тогда
			ЕстьОбработчики = Истина;
			Элементы[ИмяЭлемента].Картинка = Картинка;
		Иначе
			Элементы[ИмяЭлемента].Картинка = ПустаяКартинка;
		КонецЕсли;
	КонецЦикла;
	
	Элементы.СтраницаОбработчикиСобытий.Картинка = ?(ЕстьОбработчики, Картинка, ПустаяКартинка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТекущийАктивныйОбработчик() 
	
	ИмяТекВкладки = Элементы.СтраницыАлгоритмы.ТекущаяСтраница.Имя;
	ТекущийАктивныйОбработчик = СтрЗаменить(ИмяТекВкладки, "Страница", "");
	
КонецПроцедуры //ОбновитьТекущийАктивныйОбработчик

#КонецОбласти

#КонецОбласти

#Область ИнициализацияФормы

Если КоллекцияСКД = Неопределено Тогда
	КоллекцияСКД = Новый Структура;
КонецЕсли;

#КонецОбласти
